In [3]:
import pandas as pd
import numpy as np

## Relational Algebra

The behavior implemented in pd.merge() is a subset of what is known as relational algebra, which is a formal set of rules for manipulating relational data, and forms the conceptual foundation of operations available in most databases. The strength of the relational algebra approach is that it proposes several primitive operations, which become the building blocks of more complicated operations on any dataset. With this lexicon of fundamental operations implemented efficiently in a database or other program, a wide range of fairly complicated composite operations can be performed

The ``pd.merge()`` function allow us to merge columns of different data frames.

## Category of Joins

### One-to-One Join

The pd.merge() function recognizes that each DataFrame has an "employee" column, and automatically joins using this column as a key.

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [5]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [6]:
pd.merge?

## Many_to_One

Many-to-one joins are joins in which one of the two key columns contains duplicate entries. For the many-to-one case, the resulting DataFrame will preserve those duplicate entries as appropriate. Consider the following example of a many-to-one join:

In [7]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## Many_to_Many

In [8]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
# On this case, 'group' will be the key column to merge
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

# Specification of the Merge Key

We've already seen the default behavior of pd.merge(): it looks for one or more matching column names between the two inputs, and uses this as the key. However, often the column names will not match so nicely, and pd.merge() provides a variety of options for handling this.

## The 'on' keyword

On this case, we are specifying on which column the ``merge`` function will use as a key to...merge our data frames.

In [9]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## The 'left_on' and 'right_on' keywords

At times you may wish to merge two datasets with different column names; for example, we may have a dataset in which the employee name is labeled as "name" rather than "employee". In this case, we can use the left_on and right_on keywords to specify the two column names:

In [10]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [11]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

## The 'left_index' and 'right_index' keywords

Sometimes, rather than merging on a column, you would instead like to merge on an index. For example, your data might look like this:

In [12]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

print(df1a)
print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [13]:
# Here we are merging with the left_index and the right_index of the two df's
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

## Joins

### Inner Join

The inner join method merge two data frames with the same keys at the columns. If some key is in one and not in another, this row will be not be merged on the final data frame.

In [40]:
df1 = pd.DataFrame([{'Name': 'William', 'Last Name': 'Sales', 'Course': 'Engineering'},
                    {'Name': 'João', 'Last Name': 'Liberato', 'Course': 'Statistics and DS'},
                    {'Name': 'Clara', 'Last Name': 'Gomes', 'Course': 'Accounting'}, 
                    {'Name': 'Manuela', 'Last Name': 'Lima', 'Course': 'Law'}])
df1

      Name Last Name             Course
0  William     Sales        Engineering
1     João  Liberato  Statistics and DS
2    Clara     Gomes         Accounting
3  Manuela      Lima                Law

In [39]:
df2 = pd.DataFrame([{'Names': 'William', 'Interests': 'Coding'}, 
                    {'Names': 'João', 'Interests': 'Data Science'},
                    {'Names': 'Clara', 'Interests': 'Excel'}, 
                    {'Names': 'Luiza', 'Interests': 'Psychology'}])
df2

     Names     Interests
0  William        Coding
1     João  Data Science
2    Clara         Excel
3    Luiza    Psychology

In [41]:
pd.merge(df1, df2, left_on='Name', right_on='Names', how='inner').drop('Names', axis=1)

      Name Last Name             Course     Interests
0  William     Sales        Engineering        Coding
1     João  Liberato  Statistics and DS  Data Science
2    Clara     Gomes         Accounting         Excel

### Left Join

On left join method, the merged data frame will conatin the intersection between the key values considered and **all** the keys on the **left data frame** considered, although it doesn't have keys intersections.

If some row on the left data frame will be on the merged data frame and the right data frame does not have a value for it at some column, pandas will fill this 'blank space' with NaN value. Because of that, we have to use ``fillna()`` function to clean the resulting data frame.

In [44]:
df_left_merged = pd.merge(df1, df2, left_on='Name', right_on='Names', how='left').drop('Names', axis=1)
df_left_merged

      Name Last Name             Course     Interests
0  William     Sales        Engineering        Coding
1     João  Liberato  Statistics and DS  Data Science
2    Clara     Gomes         Accounting         Excel
3  Manuela      Lima                Law           NaN

In [68]:
df_left_merged.fillna('No interest', inplace=True)
df_left_merged

      Name Last Name             Course     Interests
0  William     Sales        Engineering        Coding
1     João  Liberato  Statistics and DS  Data Science
2    Clara     Gomes         Accounting         Excel
3  Manuela      Lima                Law   No interest

### Right Join

The right join method takes the rows on the match of the two data frames keys and all the rows of the right data frame. If the right data frame has a column which the match (intersection) does not, pandas will put null at the corresponding cell.

In [73]:
df_right_merged = pd.merge(df1, df2, left_on='Name', right_on='Names', how='right').drop(['Name', 'Last Name'], axis=1)
df_right_merged

              Course    Names     Interests
0        Engineering  William        Coding
1  Statistics and DS     João  Data Science
2         Accounting    Clara         Excel
3                NaN    Luiza    Psychology

In [74]:
df_right_merged.fillna('Without course', inplace=True)
df_right_merged

              Course    Names     Interests
0        Engineering  William        Coding
1  Statistics and DS     João  Data Science
2         Accounting    Clara         Excel
3     Without course    Luiza    Psychology

### Outer Join

In outer joing method, it's like a 'union', all the key values (rows) will be merged on the final data frame. If there are cells which values does not match between the two data frames, NaN values will be replaced in.

In [75]:
df_outer_joined = pd.merge(df1, df2, left_on='Name', right_on='Names', how='outer')
df_outer_joined
# Such a chaos trying to do that without renaming the columns, isn't it?

      Name Last Name             Course    Names     Interests
0  William     Sales        Engineering  William        Coding
1     João  Liberato  Statistics and DS     João  Data Science
2    Clara     Gomes         Accounting    Clara         Excel
3  Manuela      Lima                Law      NaN           NaN
4      NaN       NaN                NaN    Luiza    Psychology